In [2]:
# Impoting required packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# setting default option
pd.set_option("mode.copy_on_write", True)

In [3]:
# loading the Datasets
population = pd.read_parquet("../../Data/processed/population.parquet")
mortality = pd.read_parquet("../../Data/processed/mortality.parquet")

In [4]:
population.sample(5)

                State State_Code      County County_Code  Year  Population
25662    North Dakota         38        EDDY       38027  2003        2656
35025           Texas         48        RUSK       48401  2006       50415
2489       California         06  SAN BENITO       06069  2009       54436
24257  North Carolina         37        ASHE       37009  2015       26625
13833        Kentucky         21   ROBERTSON       21201  2004        2298

In [5]:
mortality.sample(5)

,State,County,County_Code,Year,Cause,Deaths
6435,OR,MULTNOMAH,41051,2011,All other drug-induced causes,19
8737,IN,FAYETTE,18041,2014,Drug poisonings (overdose) Unintentional (X40-...,15
10383,WA,SPOKANE,53063,2015,Drug poisonings (overdose) Suicide (X60-X64),18
3687,MD,FREDERICK,24021,2008,Drug poisonings (overdose) Undetermined (Y10-Y14),13
675,CO,JEFFERSON,08059,2004,Drug poisonings (overdose) Unintentional (X40-...,18

In [6]:
# list of interested states
state_list = ["AZ", "NM", "TX", "LA", "MS", "AR", "OK"]

In [7]:
# subset the data
mortality = mortality[mortality["State"].isin(state_list)]

In [31]:
# checl number of times each county appears in the data
mortality["County_Code"].value_counts().value_counts()

count
1     23
13    19
2     11
10    11
5     10
6      9
4      8
7      8
8      8
3      6
11     5
9      4
15     4
12     4
14     3
16     3
28     3
25     2
33     2
48     1
18     1
21     1
22     1
31     1
32     1
37     1
52     1
Name: count, dtype: int64

In [27]:
mortality[mortality["County_Code"] == "48347"]

,State,County,County_Code,Year,Cause,Deaths
10297,TX,NACOGDOCHES,48347,2015,Drug poisonings (overdose) Unintentional (X40-...,15

In [32]:
# Grouping the data since individual categoires have low values
mortality_2 = (
    mortality.groupby(["State", "County_Code", "County", "Year"])["Deaths"]
    .sum()
    .reset_index()
)

In [36]:
assert mortality_2["Deaths"].sum() == mortality["Deaths"].sum()

In [37]:
mortality_2["County_Code"].value_counts().value_counts()

count
13    43
1     23
2     11
10    10
5     10
8      9
6      9
7      8
4      8
11     6
3      6
12     4
9      4
Name: count, dtype: int64

In [35]:
mortality_2[mortality_2["County_Code"] == "48221"]

    State County_Code County  Year  Deaths
909    TX       48221   HOOD  2013      10

In [19]:
# Combination list
unique_combis = (
    mortality[["State", "County", "County_Code"]]
    .drop_duplicates()
    .reset_index(drop=True)
)

In [20]:
unique_combis

    State       County County_Code
0      AZ      COCHISE       04003
1      AZ     COCONINO       04005
2      AZ     MARICOPA       04013
3      AZ       MOHAVE       04015
4      AZ         PIMA       04019
..    ...          ...         ...
146    OK     DELAWARE       40041
147    LA    VERMILION       22113
148    MS        LAMAR       28073
149    OK      MCCLAIN       40087
150    TX  NACOGDOCHES       48347

[151 rows x 3 columns]

In [22]:
# Combination list
unique_combis2 = mortality[["State", "County"]].drop_duplicates().reset_index(drop=True)
unique_combis2

    State       County
0      AZ      COCHISE
1      AZ     COCONINO
2      AZ     MARICOPA
3      AZ       MOHAVE
4      AZ         PIMA
..    ...          ...
146    OK     DELAWARE
147    LA    VERMILION
148    MS        LAMAR
149    OK      MCCLAIN
150    TX  NACOGDOCHES

[151 rows x 2 columns]